1password
1password-cli
adobe-acrobat-reader
alfred
authy
bartender
cheatsheet
chromedriver
chromium
codex
contexts
dash
discord
dockdoor
docker
docker-desktop
dupeguru
fig
firefox
fleet
font-roboto-mono-nerd-font
gimp
google-chrome
gpg-suite
graphiql
iina
iterm2
little-snitch
micro-snitch
miro
netdownloadhelpercoapp
ollama
ollama-app
pdf-expert
qlvideo
rstudio
rubymine
slack
spotify
the-unarchiver
tinymediamanager
transmission
tuxguitar
vagrant
visual-studio-code
vlc
wireshark
wireshark-app
zen
zen-browser
