rubymine
fleet
fig
alfred
google-chrome
firefox
iterm2
the-unarchiver
cheatsheet
slack
discord
rubymine
visual-studio-code
docker
little-snitch
micro-snitch
iina
gpg-suite
spotify
wireshark
contexts
bartender
authy
obs
dash
1password
obs
transmission
paragon-ntfs
qlvideo
wkhtmltopdf
