# Homebrew bundle for this dotfiles repo.
# Managed by hand.

# Third-party taps
tap "evanpurkhiser/personal"
tap "rwx-research/tap"
tap "hashicorp/tap"
tap "jandedobbeleer/oh-my-posh"
tap "lgrees/lgrees"

# Formulae
brew "mas"
brew "ant"
brew "aom"
brew "apr"
brew "apr-util"
brew "argon2"
brew "aria2"
brew "aribb24"
brew "asdf"
brew "autoconf"
brew "automake"
brew "awscli"
brew "bat"
brew "bfg"
brew "brotli"
brew "ca-certificates"
brew "cairo"
brew "cffi"
brew "chromaprint"
brew "cjson"
brew "cmake"
brew "coreutils"
brew "cryptography"
brew "curl"
brew "czkawka"
brew "dav1d"
brew "exiftool"
brew "eza"
brew "ffmpeg"
brew "fftw"
brew "flac"
brew "flyctl"
brew "fontconfig"
brew "fortune"
brew "freetds"
brew "freetype"
brew "frei0r"
brew "fribidi"
brew "gcc"
brew "gd"
brew "gdbm"
brew "gemini-cli"
brew "gettext"
brew "gh"
brew "ghostscript"
brew "giflib"
brew "git"
brew "git-delta"
brew "git-extras"
brew "glib"
brew "gmp"
brew "gnupg"
brew "gnutls"
brew "gpgme"
brew "graphite2"
brew "gum"
brew "harfbuzz"
brew "highway"
brew "htop"
brew "hwloc"
brew "icu4c@76"
brew "icu4c@77"
brew "imagemagick"
brew "imath"
brew "isl"
brew "ivy"
brew "jasper"
brew "jbig2dec"
brew "jpeg-turbo"
brew "jpeg-xl"
brew "jq"
brew "evanpurkhiser/personal/keyfinder-cli"
brew "krb5"
brew "lame"
brew "leptonica"
brew "libarchive"
brew "libass"
brew "libassuan"
brew "libavif"
brew "libb2"
brew "libbluray"
brew "libde265"
brew "libdeflate"
brew "libevent"
brew "libgcrypt"
brew "libgit2"
brew "libgpg-error"
brew "libheif"
brew "libidn"
brew "libidn2"
brew "libkeyfinder"
brew "libksba"
brew "liblinear"
brew "liblqr"
brew "libmicrohttpd"
brew "libmpc"
brew "libnghttp2"
brew "libogg"
brew "libomp"
brew "libpng"
brew "libpq"
brew "libraw"
brew "librist"
brew "libsamplerate"
brew "libsndfile"
brew "libsodium"
brew "libsoxr"
brew "libssh"
brew "libssh2"
brew "libtasn1"
brew "libtiff"
brew "libtommath"
brew "libtool"
brew "libunibreak"
brew "libunistring"
brew "libusb"
brew "libuv"
brew "libvidstab"
brew "libvmaf"
brew "libvorbis"
brew "libvpx"
brew "libvterm"
brew "libx11"
brew "libxau"
brew "libxcb"
brew "libxdmcp"
brew "libxext"
brew "libxrender"
brew "libyaml"
brew "libzip"
brew "little-cms2"
brew "llvm"
brew "lpeg"
brew "lua"
brew "luajit"
brew "luarocks"
brew "luv"
brew "lz4"
brew "lzo"
brew "m4"
brew "mbedtls"
brew "mpdecimal"
brew "mpfr"
brew "mpg123"
brew "msgpack"
brew "ncdu"
brew "ncurses"
brew "neovim"
brew "net-snmp"
brew "nettle"
brew "nmap"
brew "node"
brew "npth"
brew "nspr"
brew "nss"
brew "ollama"
brew "oniguruma"
brew "open-mpi"
brew "openblas"
brew "opencore-amr"
brew "openexr"
brew "openjdk"
brew "openjpeg"
brew "openldap"
brew "openssl@3"
brew "opus"
brew "p11-kit"
brew "pandoc"
brew "pango"
brew "pcre"
brew "pcre2"
brew "phoneinfoga"
brew "php"
brew "pinentry"
brew "pipx"
brew "pixman"
brew "pkg-config"
brew "pmix"
brew "poppler"
brew "postgresql@14"
brew "projectm"
brew "pycparser"
brew "python-packaging"
brew "python-tk@3.12"
brew "python@3.10"
brew "python@3.11"
brew "python@3.12"
brew "python@3.13"
brew "r"
brew "rav1e"
brew "readline"
brew "lgrees/lgrees/resy"
brew "ripgrep"
brew "rtmpdump"
brew "rubberband"
brew "rust"
brew "rwx-research/tap/abq"
brew "sane-backends"
brew "sdl2"
brew "shared-mime-info"
brew "snappy"
brew "speedtest-cli"
brew "speex"
brew "sqlite"
brew "srt"
brew "svt-av1"
brew "tcl-tk"
brew "tcl-tk@8"
brew "hashicorp/tap/terraform"
brew "tesseract"
brew "theora"
brew "tidy-html5"
brew "tig"
brew "tlrc"
brew "tmux"
brew "tree"
brew "tree-sitter"
brew "unbound"
brew "unibilium"
brew "unixodbc"
brew "utf8proc"
brew "uv"
brew "vips"
brew "webp"
brew "wget"
brew "x264"
brew "x265"
brew "xorgproto"
brew "xvid"
brew "xz"
brew "yt-dlp"
brew "zeromq"
brew "zimg"
brew "zsh"
brew "zstd"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"

# Casks
cask "1password"
cask "1password-cli"
cask "adobe-acrobat-reader"
cask "adobe-creative-cloud"
cask "alcove"
cask "alfred"
cask "amazon-photos"
cask "antigravity"
cask "balenaetcher"
cask "bartender"
cask "beeper"
cask "chatgpt"
cask "chatgpt-atlas"
cask "chromedriver"
cask "chromium"
cask "cloudflare-warp"
cask "codex"
cask "contexts"
cask "dash"
cask "daisydisk"
cask "darktable"
cask "disk-drill"
cask "discord"
cask "dockdoor"
cask "docker-desktop"
cask "dupeguru"
cask "fig"
cask "figma"
cask "firefox"
cask "folder-preview-pro"
cask "gimp"
cask "google-chrome"
cask "google-drive"
cask "gpg-suite"
cask "graphiql"
cask "helium"
cask "ik-product-manager"
cask "jordanbaird-ice"
cask "iina"
cask "ilok-license-manager"
cask "imageoptim"
cask "insta360-link-controller"
cask "iris"
cask "iterm2"
cask "jetbrains-toolbox"
cask "keyclu"
cask "kodi"
cask "little-snitch"
cask "megasync"
cask "micro-snitch"
cask "mixed-in-key"
cask "miro"
cask "netdownloadhelpercoapp"
cask "netspot"
cask "ollama-app"
cask "orbstack"
cask "pearcleaner"
cask "pdf-expert"
cask "plex"
cask "postman"
cask "quicklook-video"
cask "rstudio"
cask "rubymine"
cask "sigmaos"
cask "slack"
cask "sonos"
cask "soulseek"
cask "spotify"
cask "steam"
cask "telegram"
cask "the-unarchiver"
cask "tinymediamanager"
cask "transmission"
cask "typora"
cask "tuxguitar"
cask "ultimate-vocal-remover"
cask "unifi-identity-endpoint"
cask "upscayl"
cask "vagrant"
cask "veracrypt"
cask "virtual-desktop-streamer"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "vuescan"
cask "wacom-tablet"
cask "wireshark-app"
cask "zen"

# Mac App Store apps. Sign into the App Store before running the installer.
mas "1Password for Safari", id: 1569813296
mas "Amphetamine", id: 937984704
mas "Brother iPrint&Scan", id: 1193539993
mas "Capital One Shopping", id: 1477110326
mas "Capo", id: 696977615
mas "CCCCorners", id: 6754601983
mas "Copilot", id: 1447330651
mas "DevCleaner", id: 1388020431
mas "Discovery", id: 1381004916
mas "Fantastical", id: 975937182
mas "Ferromagnetic", id: 1546537151
mas "Flow", id: 1423210932
mas "GarageBand", id: 682658836
mas "Home Assistant", id: 1099568401
mas "iMovie", id: 408981434
mas "Infuse", id: 1136220934
mas "Keynote", id: 409183694
mas "Klack", id: 6446206067
mas "Magnet", id: 441258766
mas "Markdown Preview", id: 6739955340
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "MQTT Explorer", id: 1455214828
mas "Negative", id: 1378123825
mas "Numbers", id: 409203825
mas "OmniFocus", id: 1346203938
mas "OmniFocus 2", id: 1542143627
mas "OneDrive", id: 823766827
mas "Outpost", id: 6749519388
mas "P-touch Editor", id: 1453365242
mas "Pages", id: 409201541
mas "Parcel", id: 375589283
mas "PayPal Honey", id: 1472777122
mas "Snip", id: 1538901870
mas "SnipTag", id: 1448677570
mas "Spark Desktop", id: 6445813049
mas "Structured", id: 1499198946
mas "TextSniper", id: 1528890965
mas "Tonebridge Guitar Effects", id: 1263858588
mas "ToothFairy", id: 1191449274
mas "Twingate", id: 1501592214
mas "Vythm", id: 1550581532
mas "Windows App", id: 1295203466

# Go tools
# go "golang.org/x/tools/gopls"

# Cargo tools
# cargo "cargo-nextest"

# uv tools
uv "specify-cli"
